{
  "url": "https://www.occamsadvisory.com/audit-advisory",
  "scraped_at": "2025-05-03T12:13:54.366Z",
  "page_content": "ERC Audit Advisory For 2024\nBook Free Consultation\nFind out if you qualify!\nHave you claimed the ERC?\nPlease Select\nYes\nNo\nUnsure\nHave you received an audit or IDR from the IRS regarding your ERC?\nPlease Select\nYes\nNo\nUnsure\nHow many quarters did you claim?\n\n Q2 2020\n\n Q3 2020\n\n Q4 2020\n\n Q1 2021\n\n Q2 2021\n\n Q3 2021\n\nIn what state is the primary business located?\nPlease Select\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nWho helped you claim the ERC?\nOccams ERC Audit Advisory:\n\nOur ERC Audit Advisory includes leading risk management strategies and processes Occams deploys to manage the risk that either an ineligible employer has claimed ERC, or the amounts claimed are not per the guidance provided by lawmakers and the program’s agent IRS. In recognition of the extraordinary challenges faced by ERC advisory service providers, Occams has developed for all ERC claimants, expertise directly related to the response to, and managing various ERC audit risks up to the tax court.\n\nScope of Audit Advisory:\n\nWe will be offering specifically trained research analysts, and subject matter specialists dedicated to the ERC Program. Our services will include:\n\nReview of ERC computations, including adjustments of PPP loan/s (if applicable), exclusion of majority owners’ family members’ payroll from ERC eligible payroll, and all other statutory adjustments\nPreliminary assessment of eligibility based on criteria as available under the Program\nConduct detailed interview with You to establish ERC eligibility and compilation of metrics as evidence for eligibility\nExtending audit support for the maximum period of potential audit by IRS\nTalk with our\nTax Experts today!\n\nPayroll providers and other professionals do not have the time to dive into the legislation and other moving parts of the ERC program. That is why we put together a team of dedicated tax professionals who can work with business owners and financial officers to ensure you receive the maximum benefit from this important, but often misunderstood relief program.\n\nSo, even if you already got an opinion from another tax professional, we encourage you to spend 15 minutes with our team for trusted due diligence on your eligibility for ERC and why you may be entitled even if you did not experience a drop in revenue.\n\nBook Free Consultation\n\n Anupam Satyasheel\nFounder\n\n David King\nDeputy CEO\n\n Josh Westfall\nChief Revenue Officer – Tax Advisory\n\n Amber E Kellogg\nVP - Affiliate Origination & Management\n\nBOOK\nA Free Consultation\n\nBook a no-obligation 15-minute consult and join thousands of other\nbusiness that we are helping qualify for the program.\n\nTop 3 Awards in 2025\n\nCelebrating Excellence: Top Accolades in Business and Workplace Environment\n\nFORTUNE AMERICA’S\nMost Innovative Companies\nAward list – 2023.\n\nThis award recognizes Occams Advisory for its excellence in product innovation, process innovation, and innovation culture, as selected by Fortune and Statista Inc..\n\nFinancial Times’ The Americas’ Fastest-Growing Companies - 2020 to 2023, 2025\nRank 159\n\nOccams Advisory is thrilled to be recognized in the Financial Times' 2025 list of the Americas' Fastest-Growing Companies. This achievement underscores our relentless pursuit of excellence and innovation, driving sustained growth and industry leadership.\n\nINC 5000\nFastest Growing US Companies – 2016 to 2021, 2023 and 2024\n\nThis marks the eight time in nine years that the company has been recognized on this prestigious list of the fastest-growing private companies in America.\n\nView All Awards\nClients\nTestimonials\nBLOG\nDeep Insights\nOccams ERC Audit Advisory: Mitigating Risks and Ensuring Compliance\n\nThe Employee Retention Credit (ERC) has been a lifeline for many businesses during the COVID-19 pandemic. However, the complexity of the ERC program and the recent surge in fraudulent claims have made ERC claimants and recipients at high risk of audits.\n\nRead More\nFrom Panic to Poise: Unraveling the Mystery of the IRS Audit (and Winning)\n\nThe dreaded IRS audits. It’s enough to send shivers down anyone’s spine. Images of mountains of paperwork, confusing jargon, and stern-faced agents flash before our eyes. But fear not, taxpayers! An audit doesn’t have to be a nightmare. With the right...\n\nRead More\nSleepless Nights from Your ERC Claim? Occams Advisory’s Tax Wizards Expose Hidden Audit Dangers\n\nThe hangover from the pandemic lingers. Your business survived but claiming the Employee Retention Credit (ERC) left you with an uneasy feeling. Was everything filed correctly? Did you miss a crucial detail? Don’t toss and turn – Occams Advisory, your tax-wielding...\n\nRead More\nBrowse All"
}