{
  "url": "https://www.occamsadvisory.com/employee-retention-tax-credits",
  "scraped_at": "2025-05-03T12:13:50.747Z",
  "page_content": "IRS Resumes ERC Claim Processing.\n400,000+ claims already in process of Approval in 2024*, with hundreds of thousands more set for approval in 2025.\n\n\nDonʼt Leave Money on the Table. Billions of dollars are still available for eligible businesses.\n\n\nDeadline Approaching: April 15, 2025.\nBook Free Consultation\nFind out if you qualify!\n\n\nHow many W2 employees are on your payroll? *\nPlease Select\n5 - 10\n11- 50\n51-100\n101-500\nEvery business was impacted via delays and shutdowns. Please select Yes if your business was negatively impacted in anyway, even if it was minor. *\nPlease Select\nYes\nNo\nUnsure\nDid your business experience a decline in gross receipts for any quarter in 2020 or 2021 compared to 2019? *\nPlease Select\nYes\nNo\nUnsure\nDid your business receive PPP loans in 2020 or 2021? *\nPlease Select\nYes\nNo\nNot Sure\n\nOccams Group is excited to announce that we have partnered with The Small Business Association of Michigan (SBAM) to be their Employee Retention Credit (ERC) Preferred Partner for their 31,000 + members.\n\nWe have a dedicated team of 55+ Employee Retention Credit (ERC) specialists. Our team of experts has helped over a thousand businesses across the country with their ERC claim.\n\nWith our highly automated process we are able to finalize the computation of the ERC amounts with in 48-72 hours of receiving the required documents.\n\nLearn More\nGet the Support Your Business Deserves with ERC Tax Credits\nDedicated specialists that will interpret highly complex program rules and\nwill be available to answer your questions.\nERC Facts | No need to Repay\nYour business may qualify for up to $26,000 per employee\nAs of early March, the IRS had paid more than $150 billion in ERC refunds*\nA firm of 50 employees can possibly claim $500,000\nBusiness with PPP can apply if they meet qualifications and avoid using same salaries\nBusinesses that did not show decline in gross receipts but were impacted by legislative orders may qualify\nA credit can be claimed retroactively starting 2020\nCheck Your Business Eligibility\n\nDisclaimer: Claims are subject to meeting qualifications set forth by law as administered by IRS.\n\nSource: *https://t.ly/oACE8\n\nSmall Business Success Stories\nBelow are the tax credits that we helped our clients qualify for under the CARES Act.\n\nLearn How to Claim Your\n\nEmployee Retention\nTax Credit in 2025.\nApply Now  Play Video\nEstimate your\nERC Payout\n\nNumber of Employees :  2\n\n\n$52,000\n\nLet's Talk!\nBook Free Consultation\nTalk with our\nTax Experts today!\n\nPayroll providers and other professionals do not have the time to dive into the legislation and other moving parts of the ERC program. That is why we put together a team of dedicated tax professionals who can work with business owners and financial officers to ensure you receive the maximum benefit from this important, but often misunderstood relief program.\n\nSo, even if you already got an opinion from another tax professional, we encourage you to spend 15 minutes with our team for trusted due diligence on your eligibility for ERC and why you may be entitled even if you did not experience a drop in revenue.\n\nBook Free Consultation\n\n Anupam Satyasheel\nFounder\n\n David King\nDeputy CEO\n\n Josh Westfall\nChief Revenue Officer – Tax Advisory\n\n Amber E Kellogg\nVP - Affiliate Origination & Management\n\nFeatured In :-\n\nBOOK\nA Free Consultation\n\nBook a no-obligation 15-minute consult and join thousands of other\nbusiness that we are helping qualify for the program\n\nVoices of Delight Real Stories of Success and Satisfaction\nDiscover our satisfied clients' firsthand experiences and glowing endorsements through captivating video testimonials, providing genuine insights into their success stories and why they choose us.\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\nClients\nTestimonials\nGreat experience All of the people I worked with were very professional and prompt in answering all the questions I had. Great Job!! To all involved\nBill Wegleitner\nWorking with Occams was a fantastic experience. They were excellent communicators and came through on all of their promises. I was a little skeptical of at first, as I am sure most people were, but they delivered!\nRye Nazarian\nAll representatives were very knowledgeable and customer service oriented. I felt they wanted to assist me and insure my needs were met. All my questions and concerns were addressed in a caring and professional manner- Thank you Fidelity and OCCAMS for your support in this effort!!!!!\nBennie O Brooks\nThe company was clear in what they needed from us to get the application submitted, and they handled the rest. They do not get paid until you do.\nSusan Szymborski\nDid exactly what they said they would do and they got us all this money that we didn’t even know about. Very easy and pleasant experience.\nJeremy Henri\nGreat experience All of the people I worked with were very professional and prompt in answering all the questions I had. Great Job!! To all involved\nBill Wegleitner\nWorking with Occams was a fantastic experience. They were excellent communicators and came through on all of their promises. I was a little skeptical of at first, as I am sure most people were, but they delivered!\nRye Nazarian\n1\n2\n3\n4\n5\nFree Leading Insights on Employee Retention Credit\n\nDownload our leading insights on the employee retention credit to help you qualify before it ends.\n\nDownload for FREE\nBlogs: Insights & Thought Leadership\n\nExplore Our Latest Articles on Business Growth and Innovation\n\nOptimizing Client Relations with AI in 2025\n\nApr 28, 2025\n\nBlog At A Glance: Introduction Customer Experience: The New Competitive Advantage The Strategic Path Forward Final Thoughts Introduction In today’s ultra-competitive market, where businesses are often offering similar products or services, one thing increasingly...\n\n\nRead More\nNavigating the Generative Search Revolution: A Guide to GEO and Sustaining SEO Excellence\n\nApr 21, 2025\n\nBlog At A Glance: Introduction Decoding GEO Key Strategies for GEO Success The Indispensable Role of Education and Consistency Conclusion Introduction The digital realm is in constant flux, and the emergence of generative search engines, spearheaded by...\n\n\nRead More\nBrowse All\nOur Events\n\n15 November 2024 | Los Angeles, CA\n\nAS being honored Saahas\nfor Cause 2nd Annual\nGala\nOccams Advisory proudly supported the Saahas for Cause 2nd Annual Gala, an event dedicated to empowering the South Asian community in Los Angeles and Orange County. Anupam Satyasheel, Founder & CEO, along...\nRead More \n\n25 October 2024 | Newport Beach, CA\n\nTieConWest 2024 Conference and Occams Advsiory participation\nOccams Advisory proudly participated in TiECon West 2024, held on October 25, 2024. This premier business growth summit brought together industry leaders, entrepreneurs, and investors for a day of networking and...\nRead More \nBrowse All\n– FAQ’s\nWhat is the Employee Retention Tax Credit (ERTC) and how is it different from the Payroll Protection Program (PPP)?\n\nThe Coronavirus Aid, Relief, and Economic Security Act (also known as the CARES Act ) was signed into law on March 27, 2020. It included two programs to assist businesses with keeping workers employed: the Payroll Protection Program (PPP) administered by the Small Business Adminstration and Employee Retention Tax Credit (ERTC) administered by the Internal Revenue Service.\n\n\n\n\nPPP funds are distributed based on 2.5 months of payroll and a minimum of 80% of the funds must be used on payroll to be eligible for forgiveness. Additionally, PPP funds are not taxable as revenue and you may still take deductions for the payroll covered by PPP.\n\n\n\n\nERTC tax credits, however, are credits (or refunds) for a percentage of payroll in each quarter that you qualify. There are specific rules for determining eligibility by quarter, and limiting the dollars that can be claimed for each employee.\n\nERC eligibility requirements\nWhat are “qualified wages” and how to claim credits?\nHow does the number of employees factor into the ERC?\nI got PPP funds already. Can I also get ERTC?\nHow do I apply for ERTC tax credits?\nMy revenue in Q1 2021 is back to pre-pandemic levels - so I must be ineligible - right?\nI thought payroll taxes deferred in 2020 had to be re-paid. Does ERTC work the same way?\nWhy isn't my bank talking about this?\nWill my Tax CPA handle this for me since they handle my income tax returns?\nWhat about my Payroll Service Provider? Shouldn't they be on top of this?\nWhy did the IRS issue a warning about 3rd party processing companies?\nHow long does the IRS have to audit my ERC?\nAre there any restrictions on how I can spend my ERC refund?\nBrowse All FAQ's"
}