{
  "url": "https://www.occamsadvisory.com/our-team",
  "scraped_at": "2025-05-03T12:14:00.867Z",
  "page_content": "Leadership Teams\nOur Empowered Team\n\nWe believe in engaging people who are instinctively inclined to support our clients and yet challenge them to superior levels. Our people measure our success by a singular yardstick – the measurable impact of our services to our clients. We strive to build a work-culture where client’s success is synonymous with ours.\n\nWe believe that success is to do the right things for our clients, our people and our communities. Our team consists of smart, driven individuals prioritizing output and getting work done. We value the relationships that we build. Unless we can become an extension of our clients’ agenda and expectations, we consider ourselves sub-optimal in our efforts. Our single-minded dedication to our clients’ ends is the reason why our clients recommend us to others. People at Occams work hard but try not to take ourselves too seriously.\n\nRead More\nAnupam Satyasheel\nFounder & Group CEO\n\nAnupam founded Occams Advisory in 2011 and has served as the CEO since 2012. Anupam has advised many CEOs and boards. Under his leadership, Occams has achieved exceptional results for its clients across industries and geographies. Prior to founding Occams, Anupam spent over half a decade on Wall Street with names like Barclays, Merrill Lynch, ScotiaBank et al.\n\nAnupam lives and works from Long Beach, CA with his physician wife and two boys. He spends his evenings balancing professional after-hours with baseball and golf with his boys, culinary experiments with his family and deep dive into books on growth, success, and astrophysics. Anupam also serves on the boards of Child Literacy and The Blossom Project, charities dedicated to providing educational opportunities to children in need.\n\nDavid King\nDeputy CEO\n\nDavid is a result and growth-oriented leader with executable strategic thinking. He spent many years with global banks in Europe before starting his entrepreneurial career in United States. David also is a lateral thinker whose critical inputs for our strategic vision have powered client’s growth.\n\nDavid lives and works from Sarasota, FL. As a father of two boys, a dedicated husband, a caring son, and a widely liked community leader, David balances many roles in personal life too. And when he gets a few minutes to himself, he catches up with soccer, rugby and cricket or sets out to the beach for some much-needed fun on water.\n\nMukarram Dhorajiwala\nCXO (Chief Experience Officer)\n\nMukarram is a seasoned Business Development & Systems professional with extensive expertise in branding and innovation. His diversified exposure spans across functions such as Marketing, Software Development & Design, Financial Modelling, & Digital Marketing Strategy.\n\nMukarram holds a management degree from University of Mumbai. In his spare time, Mukarram is a dedicated husband, doting father to a 1-year-old and a branding fanatic. His passions include astrophysics and politics. Mukarram lives and works from Toronto, Canada\n\nAmber E Kellogg\nVP - Affiliate Origination & Management\n\nThrough her unique perspectives acquired via distinguished tenure with a luxury fashion brand and a globally leading bulge bracket bank, Amber combines creative problem solving with well-designed solution mapping to enhance the business and lives of entrepreneurs. Over her three decades of professional career, Amber has collaborated with fashion designers and financial planners. She has cultivated and perfected a unique mindset which secures upsides for businesses in transformational ways.\n\nAs an AVP for Client Relations at Occams Advisory, Amber originates new client relationships and cultivates the existing ones to problem solve in her own distinguished and distinguishing style. Amber’s client centric thinking and problem-solving orientation are distinctly matched with Occams philosophy.\n\nJosh Westfall\nChief Revenue Officer – Tax Advisory\n\nJosh has a decade of experience in client facing roles, with a specialty in financial services and tax advisory. As a VP of Tax Advisory at Occams, he heads our R&D tax credit practice helping clients save thousands on their tax liabilities.\n\nJosh graduated from Ohio State, and still lives near Columbus, OH on a small horse farm. When not tending to the farm, he enjoys golfing and all things Ohio State football and Cleveland sports.\n\nMaria Antonio\nVP - Client Relations\n\nMaria Antonio brings precision, efficiency, and transparency to her role as VP of Client Relations at Occams Advisory. She is known for her structured and results-driven approach, consistently delivering exceptional service and fostering long-term client relationships. Her reputation is built on a structured, results-driven approach, consistently delivering exceptional service and cultivating long-lasting client relationships. Maria plays a key role in managing collections and leads initiatives that enhance client satisfaction and retention. Her integrity and dedication have established a high-performance standard within her team.\n\nIn addition to overseeing client relations, Maria is instrumental in driving tactical scalability—ensuring the organization can adapt and thrive in a dynamic business environment.\n\nNedeen Nasser\nCorporate Counsel\n\nNedeen brings a rare and refreshing wholistic approach to legal matters for small businesses. Through a synergistic emphasis on the union of tax intelligence, intellectual property, and transactional legal practice, she seeks to create a proactive approach for her clients’ businesses. With expertise and insights across a wide array of agreements and corporate documents for businesses including but not limited to agreements for advertising, writing services, non-disclosure, licensing, and purchase & sales, Nedeen is the Swiss knife of corporate law.\n\nNedeen holds a Doctor of Law (JD) degree from Sandra Day O’Connor College of Law at Arizona State University and a Bachelor’s Degree in Philosophy from University of California, Los Angeles (UCLA). From her offices in Los Angeles Metropolitan, she serves her clients. Beyond her work hours, she loves to spend time with her parents and siblings’ families.\n\nVardhman Shah\nCOO (Chief Operating Officer)\n\nVardhman has a successful record in converting concepts into results. Across his stints in heading business operations and a demonstrated history of working in the information technology and financial services industry, he has excelled in creating results while balancing abstract ideas from leadership and ground level challenges from rank and file.\n\nWith exceptional skills in negotiation, customer acquisition, sales & sales operations, and customer satisfaction, Vardhman brings organized coherence to Occams’ execution support team. Vardhman holds a Post Graduate Diploma in Financial Market & Wealth Management from LN College of Management Studies in Mumbai. He spends time across Mumbai, India and Toronto, Canada.\n\nLlajaira Soto\nAVP - Client Success\n\nLlajaira is a seasoned professional with pedigree in financial services and fin-tech startups. With decades in senior roles in Fraud Prevention, Risk Management and Operations, Llajaira has strong supervisory, investigative, and problem-solving skills. She has created and documented procedures and trained teams with impressive results\n\nLlajaira has an energetic personality that easily emanates across the team. How effortlessly she executes projects while juggling a busy personal life. Her free time is typically spent with her family, church community and honing her merengue skills.\n\nRajat Garg\nVP - Tax Credits\n\nRajat is an associate member of Institute of Chartered Accountant of India with invaluable experience in financial reporting and accounting across a range of industries. He has worked with several start-ups and steered them to superior compliance and financial management. Rajat has invaluable experience of providing professional advice in strategic sectors such as financial reporting, taxation and auditing, accounting, and corporate finance.\n\nAt Occams, Rajat oversees tax advisory and accounting. He has led the evolution of Tax Advisory practice at Occams and empowered its growth. Rajat allocates his time between National Capital Region in India and Occams offices in United States. In addition to his interest in sports, Rajat also is an aspiring food entrepreneur with ideas that could revolutionize culinary experience for foodies.\n\nRamki Ramanarayanan\nDivisional CEO\n\nFor almost 20 years, Ramki has served with distinction in investment banking, private equity, and financial strategy. Ramki leads Occams Capital providing acquisition-driven growth, capital raising, joint venture and owner-exit strategies. With execution track record of over $2 billion in investment banking and PE transactions, including middle-market and lower middle-market M&A and capital raising, private equity portfolio management, and debt and equity public offerings, Ramki’s alma maters include Wells Fargo Securities, Robert W. Baird & Co and Current Capital.\n\nRamki holds an undergraduate degree in production engineering and an MBA from the Fuqua School of Business at Duke University. Ramki’s current and previous non-profit affiliations include Child Rights & You, Teach for America, Chicago, and Working In The Schools. Ramki and his wife live in Chicago, where they enjoy balancing the intense work life with solitude in nature.\n\nNitin Aggarwal\nCEO – India\n\nNitin Aggarwal is the Chief Operating Officer of Occams Advisory in India and he runs the large team of professionals who deliver exceptional services to Occams US based clients. In this role, Nitin has created immense value for the clients.\n\nPreviously, Nitin co-founded 247 Experts in 2012 and served as the company’s CEO between 2012 and 2015. During his tenure, the company grew to become a major player in digital marketing, support services, mobile application clients across all continents. Nitin was responsible for setting 247’s strategic direction and spearheading its international operations and in digital marketing, mobile applications and IT support. Prior to founding 247 Experts, Nitin worked as a digital marketing consultant, based out of New Delhi & Dehradun, India. He has been a recognized leader in affiliate marketing.\n\nNitin holds a Bachelor of Technology degree from IIT, Allahabad.\n\nPriyanka Bathwal\nAVP – Tax Advisory\n\nPriyanka is a Certified Public Accountant and a Chartered Accountant. She also holds a postgraduate degree in Commerce. She works as a Tax Advisor at Occams and helps businesses with ever-growing filing requirements and proper tax planning to help save taxes and claim refunds. She believes the right advice can help businesses save a lot of money and effort. Priyanka has worked as a partner in a professional firm where she gained experience in taxation, auditing, accounting, and regulation. One day she wants to be The Secretary of The US Department of Treasury.\n\nPriyanka is a caring wife and a mom to an adorable daughter, with whom she loves to draw and paint. Her creative mind encouraged her to get a diploma in Fashion Technology. She is a spiritual person who values culture and practices meditation.\n\nExplore Team\nStrategic Leadership & Articulate Thinking (SLAT)\n\nThis is the top-level leadership group responsible for setting the strategic direction of the organization. They articulate the vision and mission of the organization and ensure that all groups align with this strategic direction in belief and execution.\n\nView Members\nLeadership Advisory Board for Scalability\n(LABS)\n\nLABS advises the SLAT on highest organizational priorities and continuously changing regulatory, technological, and economic landscape. They provide insights and recommendations on how to scale the organization effectively and efIiciently.\n\nView Members\nManagement, Execution, and Tactical Scalability (METS)\n\nThis group is responsible for the dayto-day management of the organization. They execute the strategies set by the SLAT and advised by the LABS. They also handle tactical scalability, ensuring that the organization can adapt and scale in response to changes in the business environment.\n\nView Members\nScalability, Technology, Efficiency & Productivity (STEP)\n\nThis group focuses on the technological aspects of scalability agenda. They work on improving ef eficiency and productivity leveraging most effective and advanced technological adoption across aspects of the organization.\n\nView Members\nClient Origination & Relationship Enhancement (CORE)\n\nCORE is responsible for client acquisition and relationship management. They work on originating new client relationships and enhancing existing ones. This includes establishing and following methodology to capture, measure and enhance client experience journey.\n\nView Members\nChannel Affiliate Recruiting & Engagement (CARE)\n\nThis group focuses on the technological aspects of scalability agenda. They work on improving efficiency and productivity leveraging most effective and advanced technological adoption across aspects of the organization.\n\nView Members\nBranding, Marketing Acumen and Performance (BMAP)\n\nBMAP at Occams is dedicated to driving brand equity and marketing excellence. Our integrated approach combines immersive design, strategic media utilization, and targeted distribution networks with insightful market analysis to enhance brand performance and business growth.\n\nView Members\nTechnology, Operations, Automation and Digitization (TOAD)\n\nOccams Advisory's TOAD team enhances efficiency through advanced tech integration, optimizing operations, and driving automation and digitization for business growth.\n\nView Members\nFinance, Accounting, Risk & Legal\n(FARL)\n\nThe FARL division at Occam's Advisory consists of dedicated professionals in finance, risk management, accounting, and legal, ensuring operational excellence and propel business success.\n\nView Members\nTop 3 Awards in 2025\n\nCelebrating Excellence: Top Accolades in Business and Workplace Environment\n\nFORTUNE AMERICA’S\nMost Innovative Companies\nAward list – 2023.\n\nThis award recognizes Occams Advisory for its excellence in product innovation, process innovation, and innovation culture, as selected by Fortune and Statista Inc..\n\nFinancial Times’ The Americas’ Fastest-Growing Companies - 2020 to 2023, 2025\nRank 159\n\nOccams Advisory is thrilled to be recognized in the Financial Times' 2025 list of the Americas' Fastest-Growing Companies. This achievement underscores our relentless pursuit of excellence and innovation, driving sustained growth and industry leadership.\n\nINC 5000\nFastest Growing US Companies – 2016 to 2021, 2023 and 2024\n\nThis marks the eight time in nine years that the company has been recognized on this prestigious list of the fastest-growing private companies in America.\n\nView All Awards\nEmployee Testimonials\n\nGenuine Insights into Our Workplace Culture\n\nPeter Braganza\nAssociate - Client Relations\n\nThe company's values of maximizing human potential and achievement resonate deeply with me in my daily work. Each day, I'm encouraged to push my boundaries and strive for personal growth and development. Whether it's through ongoing learning opportunities, mentorship programs, or challenging projects, I'm constantly inspired to maximize my potential.\n\nRadhika Garg\nAnalyst - Finance & Accounting\n\nThe company has met my expectations in terms of Work culture, the dedication towards work, the challenges we face across & learning that keeps us going\n\nSoniya Ghosh\nAssociate - HCMI\n\n\"Occams Advisory has provided me with vast opportunities to explore my domain of work, helping to shape both my personality and my outlook on various aspects of my field. Working here under amazing leadership has significantly contributed to my professional development. \"\n\nSteven Miltonberg\nAVP - Client Relations\n\nOccams has consistently remained hyper employee focused on learning and evolving and supporting the company's employees has far exceeded my expectations.\n\nMaria Antonio\nAVP - Client Relations\n\n\"One of my most memorable moments at Occams Advisory was the realization that I would be working with a corporate company that offered numerous benefits and opportunities for professional growth. It was a moment of excitement and anticipation as I envisioned the possibilities for my career development and personal advancement within the organization. This realization marked a significant turning point in my professional journey, as I recognized the potential for learning, advancement, and long-term stability that Occams Advisory offers. It was a moment filled with hope and optimism for the future, knowing that I had found a company where I could thrive and achieve my career aspirations. Since that moment, I have been grateful for the support, mentorship, and opportunities for growth that Occams Advisory has provided. It has been a fulfilling experience, and I look forward to continuing to learn, evolve, and contribute to the success of the company in the years to come.\"\n\nLlajaira Soto\nAVP - Client Success\n\n\"The company's values of maximizing human potential and achievement manifest in my daily work through a consistent emphasis on trustworthiness, reliability, and accountability. Being trustworthy and reliable in the workplace means consistently demonstrating integrity through actions, not just words. I take ownership of my commitments, ensuring that I deliver high-quality work and meet deadlines. Additionally, the company fosters an environment that encourages continuous learning and professional development. This focus on growth enables me to expand my skills and knowledge, which in turn enhances my ability to contribute effectively to the team and the company's success. Collaborating with colleagues across various functions allows us to share expertise, support one another, and collectively drive towards our goals. I have seen firsthand how our values translate into tangible outcomes. For example, in working with the ERC Service, our commitment to client success means we go above and beyond to ensure clients receive the best possible guidance and support. This dedication not only helps our clients achieve their objectives but also reflects the company's broader mission of maximizing human potential and achievement. Through these practices, the values of trustworthiness, reliability, and continuous improvement are woven into the fabric of our daily operations, driving both individual and collective success.\"\n\nJesse Westfall\nAssociate - Client Relations\n\nWork from home support that allows me to maximize time with family outside of working hours.\n\nPeter Braganza\nAssociate - Client Relations\n\nThe company's values of maximizing human potential and achievement resonate deeply with me in my daily work. Each day, I'm encouraged to push my boundaries and strive for personal growth and development. Whether it's through ongoing learning opportunities, mentorship programs, or challenging projects, I'm constantly inspired to maximize my potential.\n\nRadhika Garg\nAnalyst - Finance & Accounting\n\nThe company has met my expectations in terms of Work culture, the dedication towards work, the challenges we face across & learning that keeps us going\n\nSoniya Ghosh\nAssociate - HCMI\n\n\"Occams Advisory has provided me with vast opportunities to explore my domain of work, helping to shape both my personality and my outlook on various aspects of my field. Working here under amazing leadership has significantly contributed to my professional development. \"\n\nSteven Miltonberg\nAVP - Client Relations\n\nOccams has consistently remained hyper employee focused on learning and evolving and supporting the company's employees has far exceeded my expectations.\n\nMaria Antonio\nAVP - Client Relations\n\n\"One of my most memorable moments at Occams Advisory was the realization that I would be working with a corporate company that offered numerous benefits and opportunities for professional growth. It was a moment of excitement and anticipation as I envisioned the possibilities for my career development and personal advancement within the organization. This realization marked a significant turning point in my professional journey, as I recognized the potential for learning, advancement, and long-term stability that Occams Advisory offers. It was a moment filled with hope and optimism for the future, knowing that I had found a company where I could thrive and achieve my career aspirations. Since that moment, I have been grateful for the support, mentorship, and opportunities for growth that Occams Advisory has provided. It has been a fulfilling experience, and I look forward to continuing to learn, evolve, and contribute to the success of the company in the years to come.\"\n\nLlajaira Soto\nAVP - Client Success\n\n\"The company's values of maximizing human potential and achievement manifest in my daily work through a consistent emphasis on trustworthiness, reliability, and accountability. Being trustworthy and reliable in the workplace means consistently demonstrating integrity through actions, not just words. I take ownership of my commitments, ensuring that I deliver high-quality work and meet deadlines. Additionally, the company fosters an environment that encourages continuous learning and professional development. This focus on growth enables me to expand my skills and knowledge, which in turn enhances my ability to contribute effectively to the team and the company's success. Collaborating with colleagues across various functions allows us to share expertise, support one another, and collectively drive towards our goals. I have seen firsthand how our values translate into tangible outcomes. For example, in working with the ERC Service, our commitment to client success means we go above and beyond to ensure clients receive the best possible guidance and support. This dedication not only helps our clients achieve their objectives but also reflects the company's broader mission of maximizing human potential and achievement. Through these practices, the values of trustworthiness, reliability, and continuous improvement are woven into the fabric of our daily operations, driving both individual and collective success.\"\n\n1\n2\n3\n4\n5\n6\n7\nBlogs: Insights & Thought Leadership\n\nExplore Our Latest Articles on Business Growth and Innovation\n\nOptimizing Client Relations with AI in 2025\n\nApr 28, 2025\n\nBlog At A Glance: Introduction Customer Experience: The New Competitive Advantage The Strategic Path Forward Final Thoughts Introduction In today’s ultra-competitive market, where businesses are often offering similar products or services, one thing increasingly...\n\n\nRead More\nNavigating the Generative Search Revolution: A Guide to GEO and Sustaining SEO Excellence\n\nApr 21, 2025\n\nBlog At A Glance: Introduction Decoding GEO Key Strategies for GEO Success The Indispensable Role of Education and Consistency Conclusion Introduction The digital realm is in constant flux, and the emergence of generative search engines, spearheaded by...\n\n\nRead More\nBrowse All\nOur Events\n\n15 November 2024 | Los Angeles, CA\n\nAS being honored Saahas\nfor Cause 2nd Annual\nGala\nOccams Advisory proudly supported the Saahas for Cause 2nd Annual Gala, an event dedicated to empowering the South Asian community in Los Angeles and Orange County. Anupam Satyasheel, Founder & CEO, along...\nRead More \n\n25 October 2024 | Newport Beach, CA\n\nTieConWest 2024 Conference and Occams Advsiory participation\nOccams Advisory proudly participated in TiECon West 2024, held on October 25, 2024. This premier business growth summit brought together industry leaders, entrepreneurs, and investors for a day of networking and...\nRead More \nBrowse All\nUnleash THE\nOCCAMS WAY\n\nWe offer a FREE 30-minute consultation to help you identify areas of your business or personal finances where you can get immediate results by using our evidence-based approach to superior results.\n\nGrow your Company with us\nGet Instant Help\n\nGet in touch with our team via live chat. They are available 24x7.\n\nBuzz us in! We will reply within 2-4 business hours.\n\nCall\n\nChat Support\n\nBook a Free\nConsultation\n\nEmail"
}