{
  "url": "https://www.occamsadvisory.com/blog/press-release/",
  "scraped_at": "2025-05-03T12:14:36.283Z",
  "page_content": "Press\nRelease\nOccams Advisory Ranks #159 on the 2025 Financial Times List of the Americas’ Fastest Growing Companies\nApr 8, 2025\nOccams Advisory has been ranked #159 on the Financial Times' 2025 list of the Americas' Fastest Growing Companies. Led by Founder & CEO Anupam Satyasheel, this marks the firm’s fifth consecutive appearance on the list.The recognition reflects Occams' consistent...\nTop 8 Indian American Companies in US Chamber of Commerce CO-100 List Featured on Indo NewYork Publication\nOct 26, 2024\nThe article lists the top 8 Indian-American companies featured in the US Chamber of Commerce's CO—100, highlighting their contributions to innovation and global business leadership, including Occams Advisory, founded by Anupam Satyasheel. Top 8 Indian American...\nDavid King’s insights on Leadership and Future of Businessess\nOct 1, 2024\nDavid King shares insights into his values, shaped by family influences, and his approach to leadership at Occams Advisory. The piece explores his focus on technology integration, sustainability, and helping businesses thrive globally. Meet David King - Bold Journey...\nEmpowering MSME’s through comprehensive advisory services\nNov 11, 2024\nThe article on Success Knocks highlights the recognition of Occams Advisory as one of the most influential companies to watch in 2024. It emphasizes the company's innovative approach, growth, and impact in the consulting industry as David King shares his insights DK...\nOccams Advisory recognized as INC Power Partner 2024\nOct 22, 2024\nThe article highlights the winners of the Inc. Power Partner Awards 2024, which includes Occams Advisory for its excellence in business products and services, recognizing its role in driving client success and industry impact. Power Partner Awards 2024_ Inc.'s...\nAnupam Satyasheel recognized as Top 10 influential Business Leaders of 2024\nSep 13, 2024\nProud to announce that Anupam Satyasheel, Founder and CEO of Occams Advisory, is among Medium's Top 10 Influential Business Leaders of 2024! His commitment to empowering businesses and driving social impact continues to shape the global financial landscape....\n« Older Entries"
}